{
  "segment 1": {
    "transcripts": [
      "Alright Morty, imagine a peer-to-peer chat system. There's a server that's basically a phone book - it just remembers which client uses which UDP port number.",
      "So like, the server just keeps track of everyone's address?",
      "Exactly. When you want to chat with someone, you ask the server for their port number. Simple stuff. But the client side is where things get interesting.",
      "What makes the client more complicated?",
      "The client needs to multitask, Morty. It's gotta send your messages AND listen for incoming ones at the same time. So it uses two threads - one main thread for your commands, and a listener thread that's always waiting for messages.",
      "Oh, so it's like talking and listening at the same time without getting confused?",
      "Bingo. Without that separation, you'd have chaos - like two people trying to answer the same phone. Threading keeps everything organized."
    ],
    "person": [
      "rick",
      "morty",
      "rick",
      "morty",
      "rick",
      "morty",
      "rick"
    ],
    "timestamps": [
      7.52325,
      10.609312500000001,
      17.796625000000002,
      20.386375,
      31.3614375,
      35.98875,
      42.940937500000004
    ],
    "filename": [
      "D1_S1_rick.mp3",
      "D1_S2_morty.mp3",
      "D1_S3_rick.mp3",
      "D1_S4_morty.mp3",
      "D1_S5_rick.mp3",
      "D1_S6_morty.mp3",
      "D1_S7_rick.mp3"
    ]
  },
  "segment 2": {
    "transcripts": [
      "Alright Morty, imagine your ears and mouth both trying to use the same phone line at once. Total disaster, right?",
      "Uh, yeah Rick, that sounds like it would be all garbled and stuff.",
      "Exactly! That's what happens when multiple threads grab messages from the same network socket. They step all over each other and freeze the whole system.",
      "So how do you fix that mess?",
      "Simple - make one thread the receptionist. It catches all the messages and drops them in a shared mailbox. The other thread just checks the mailbox instead of fighting for the phone line.",
      "Oh, so like having one person answer all the calls and take messages?",
      "Bingo! And we use a condition variable as a doorbell to alert when new mail arrives. No more race conditions, no more frozen systems."
    ],
    "person": [
      "rick",
      "morty",
      "rick",
      "morty",
      "rick",
      "morty",
      "rick"
    ],
    "timestamps": [
      5.3289375,
      9.1725625,
      16.542749999999998,
      18.557812499999997,
      27.443062499999996,
      31.312812499999996,
      38.761374999999994
    ],
    "filename": [
      "D2_S1_rick.mp3",
      "D2_S2_morty.mp3",
      "D2_S3_rick.mp3",
      "D2_S4_morty.mp3",
      "D2_S5_rick.mp3",
      "D2_S6_morty.mp3",
      "D2_S7_rick.mp3"
    ]
  },
  "segment 3": {
    "transcripts": [
      "Alright Morty, imagine you're trying to have a conversation while also watching for the doorbell. You can't do both perfectly at once.",
      "Oh, so like when I'm texting and my mom calls for dinner? I miss both?",
      "Exactly. Early programmers tried using separate threads - one for user input, one for connections. But then both threads fought over the terminal like idiots.",
      "Wait, what's a thread again?",
      "Think of it as separate workers doing different jobs. Problem was, they kept interrupting each other when trying to use the same keyboard.",
      "So how'd they fix it?",
      "Simple solution, Morty. Instead of waiting forever for input, check every half second. Handle any incoming connections, then go back to waiting for the user. No fighting, no chaos."
    ],
    "person": [
      "rick",
      "morty",
      "rick",
      "morty",
      "rick",
      "morty",
      "rick"
    ],
    "timestamps": [
      5.851375,
      10.191375,
      18.6586875,
      20.490875,
      27.025125,
      28.805125,
      38.3434375
    ],
    "filename": [
      "D3_S1_rick.mp3",
      "D3_S2_morty.mp3",
      "D3_S3_rick.mp3",
      "D3_S4_morty.mp3",
      "D3_S5_rick.mp3",
      "D3_S6_morty.mp3",
      "D3_S7_rick.mp3"
    ]
  }
}