{
  "segment 1": {
    "transcripts": [
      "So this kid started in pharmaceutical science, right? But then realized staring at molecules all day wasn't exactly thrilling.",
      "Wait, so they just switched majors completely? That sounds scary, Rick.",
      "Scary? Morty, they figured out what actually excited them - breaking down complex problems and turning ideas into working code. That's called self-awareness.",
      "But like, how did they know computer science was better?",
      "Two internships, personal projects, building systems real people actually use. They saw their code solving actual problems instead of just theoretical nonsense.",
      "Oh, so they found something that had real impact?",
      "Exactly. Sometimes the best career moves happen when you follow what genuinely excites you, even if it means starting over. Basic life advice, Morty."
    ],
    "person": [
      "rick",
      "morty",
      "rick",
      "morty",
      "rick",
      "morty",
      "rick"
    ],
    "timestamps": [
      5.7469375,
      10.191374999999999,
      18.4496875,
      21.6925,
      31.936124999999997,
      35.3618125,
      43.0454375
    ],
    "filename": [
      "D1_S1_rick.mp3",
      "D1_S2_morty.mp3",
      "D1_S3_rick.mp3",
      "D1_S4_morty.mp3",
      "D1_S5_rick.mp3",
      "D1_S6_morty.mp3",
      "D1_S7_rick.mp3"
    ]
  },
  "segment 2": {
    "transcripts": [
      "Alright Morty, personal projects are where real learning happens. You build stuff that actually works, not just toy examples.",
      "Like what kind of stuff, Rick?",
      "Full-stack web forums with Go and React, key-value stores in C++, concurrent web servers. You know, systems that don't fall apart when people actually use them.",
      "Wait, so you're saying I should start with simple projects and then make them more complicated?",
      "Exactly! Start with basic authentication, then add containerization, cloud deployment. Each project teaches you something new while building on what you already know.",
      "But how do I make sure my code doesn't become a mess?",
      "Structure matters, Morty. Use proper layers - controllers, services, repositories. And always test under pressure. If your system crashes when ten people use it, you learned nothing."
    ],
    "person": [
      "rick",
      "morty",
      "rick",
      "morty",
      "rick",
      "morty",
      "rick"
    ],
    "timestamps": [
      6.269375,
      8.754625,
      16.9085,
      21.95375,
      30.7084375,
      33.6116875,
      43.907562500000004
    ],
    "filename": [
      "D2_S1_rick.mp3",
      "D2_S2_morty.mp3",
      "D2_S3_rick.mp3",
      "D2_S4_morty.mp3",
      "D2_S5_rick.mp3",
      "D2_S6_morty.mp3",
      "D2_S7_rick.mp3"
    ]
  },
  "segment 3": {
    "transcripts": [
      "Alright Morty, here's the thing about internships - they teach you stuff personal projects never will. Like how to actually work with other people's messy code.",
      "Oh geez Rick, but isn't coding just coding? Like, what's so different about doing it with other people?",
      "*burp* Wrong, Morty. Real work means you can't just wait around for someone to tell you what to do. You gotta analyze problems, weigh your options, then confidently pitch solutions to your team.",
      "So like, instead of just following tutorials, you have to actually think through different ways to solve things?",
      "Exactly! Plus you learn the boring but crucial stuff - documentation, testing, clear communication. These soft skills are what separate amateur coders from actual professionals.",
      "Wait, so the technical stuff isn't even the hardest part?",
      "Nope! The hardest part is explaining your technical decisions to other humans without making them want to punch you in the face."
    ],
    "person": [
      "rick",
      "morty",
      "rick",
      "morty",
      "rick",
      "morty",
      "rick"
    ],
    "timestamps": [
      6.6350625,
      12.594625,
      23.15175,
      28.9284375,
      38.754125,
      41.761875,
      47.7736875
    ],
    "filename": [
      "D3_S1_rick.mp3",
      "D3_S2_morty.mp3",
      "D3_S3_rick.mp3",
      "D3_S4_morty.mp3",
      "D3_S5_rick.mp3",
      "D3_S6_morty.mp3",
      "D3_S7_rick.mp3"
    ]
  }
}